#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/unisorter/fileshare-infra/runs/run-EXVtYVAqqZEQjVc6

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.s3.aws_kms_key.objects: Refreshing state... [id=ad883df7-395c-47c0-b3c0-62c35508cf96]
module.s3.module.log_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.log_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.log_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=unisorter-file-share-logs]
module.s3.module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=unisorter-file-share]
module.s3.module.s3_bucket.aws_s3_bucket_policy.this[0]: Refreshing state... [id=unisorter-file-share]
module.s3.module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=unisorter-file-share]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.s3.aws_kms_key.objects has been changed
  ~ resource "aws_kms_key" "objects" {
        id                       = "ad883df7-395c-47c0-b3c0-62c35508cf96"
      + tags                     = {}
        # (10 unchanged attributes hidden)
    }
  # module.s3.module.s3_bucket.aws_s3_bucket.this[0] has been changed
  ~ resource "aws_s3_bucket" "this" {
        id                          = "unisorter-file-share"
        tags                        = {}
        # (10 unchanged attributes hidden)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "log1"
          + prefix                                 = "log1/"
          + tags                                   = {}

          + noncurrent_version_expiration {
              + days = 300
            }

          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + noncurrent_version_transition {
              + days          = 60
              + storage_class = "ONEZONE_IA"
            }
          + noncurrent_version_transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }



      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:ap-southeast-2:797849036607:key/ad883df7-395c-47c0-b3c0-62c35508cf96" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> true
            # (1 unchanged attribute hidden)
        }
        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_presign_upload_url.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.lambda_presign_upload_url.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/s3-pre-sign-upload-url"
      + retention_in_days = 0
      + tags              = {
          + "Name" = "s3-pre-sign-upload-url"
        }
      + tags_all          = {
          + "Name" = "s3-pre-sign-upload-url"
        }
    }

  # module.lambda_presign_upload_url.module.lambda_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "s3-pre-sign-upload-url-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Name" = "s3-pre-sign-upload-url"
        }
      + tags_all  = {
          + "Name" = "s3-pre-sign-upload-url"
        }
    }

  # module.lambda_presign_upload_url.module.lambda_function.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "s3-pre-sign-upload-url-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "s3-pre-sign-upload-url",
        ]
    }

  # module.lambda_presign_upload_url.module.lambda_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "s3-pre-sign-upload-url"
      + path                  = "/"
      + tags                  = {
          + "Name" = "s3-pre-sign-upload-url"
        }
      + tags_all              = {
          + "Name" = "s3-pre-sign-upload-url"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda_presign_upload_url.module.lambda_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Lambda function to create presign url for uploading object to s3 bucket"
      + filename                       = "builds/f373bca25a2f9c9e0cc341e7b6deb6658662dedf9f8d52dbb6a69fac62eea10d.zip"
      + function_name                  = "s3-pre-sign-upload-url"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "s3-pre-sign-upload-url"
        }
      + tags_all                       = {
          + "Name" = "s3-pre-sign-upload-url"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "S3_BUCKET" = "unisorter-file-share"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.lambda_presign_upload_url.module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "lambda/lambda-function.py",
                      + null,
                    ],
                ]
              + filename      = "builds/f373bca25a2f9c9e0cc341e7b6deb6658662dedf9f8d52dbb6a69fac62eea10d.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f373bca25a2f9c9e0cc341e7b6deb6658662dedf9f8d52dbb6a69fac62eea10d.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_presign_upload_url.module.lambda_function.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/f373bca25a2f9c9e0cc341e7b6deb6658662dedf9f8d52dbb6a69fac62eea10d.zip"
          + "timestamp" = "1624685833213285000"
        }
    }

  # module.s3.module.s3_bucket.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.s3.module.s3_bucket.data.aws_iam_policy_document.deny_insecure_transport[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::unisorter-file-share",
              + "arn:aws:s3:::unisorter-file-share/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.s3.module.s3_bucket.aws_s3_bucket.this[0] will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "unisorter-file-share"
        tags                        = {}
        # (10 unchanged attributes hidden)

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 7 -> null
          - enabled                                = true -> null
          - id                                     = "log1" -> null
          - prefix                                 = "log1/" -> null
          - tags                                   = {} -> null

          - noncurrent_version_expiration {
              - days = 300 -> null
            }

          - noncurrent_version_transition {
              - days          = 30 -> null
              - storage_class = "STANDARD_IA" -> null
            }
          - noncurrent_version_transition {
              - days          = 60 -> null
              - storage_class = "ONEZONE_IA" -> null
            }
          - noncurrent_version_transition {
              - days          = 90 -> null
              - storage_class = "GLACIER" -> null
            }
        }



      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = "arn:aws:kms:ap-southeast-2:797849036607:key/ad883df7-395c-47c0-b3c0-62c35508cf96"
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> false
            # (1 unchanged attribute hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.s3.module.s3_bucket.aws_s3_bucket_policy.this[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "unisorter-file-share"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::unisorter-file-share/*",
                          - "arn:aws:s3:::unisorter-file-share",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 7 to add, 2 to change, 0 to destroy.


```

</details>

*Pusher: @umangm99, Action: `pull_request`*